Revit 2027 API
ParameterTypeId.IdParam Property
 "Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IdParam { get; }
Public Shared ReadOnly Property IdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IdParam {
	ForgeTypeId^ get ();
}
static member IdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace